Revit 2027 API
LayoutRuleFixedNumber.NumberOfLines Property
Get or set the number of the beams in a beam system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfLines { get; set; }
Public Property NumberOfLines As Integer
	Get
	Set
public:
property int NumberOfLines {
	int get ();
	void set (int value);
}
member NumberOfLines : int with get, set
Property Value
Int32
Remarks
The number must be positive.
See Also
Reference
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace